public class Q2 {
    //معيب لانه يدعو طريق الشحين بشكل متكرر داخل نفسه دون اي شرط لايقاف العوده
    //يمكن ان يؤدي ذلك الى حلقه لا حصر لها
    //وفي النهايه يؤدي الى خطأ في الفائض
    //بالاضافه الى ذلك يتضمن التنفيذ رسوم عقوبه تبلغ 5 وحدات في حاله فشل الشحنات الاوليه
    //ومع ذلك لا يتحقق مما إذا كانت رسوم العقوبة ناجحة أم لا
    // وترجع دائمًا قيمة ISSUCCESS دون النظر في رسوم العقوبه
    //لإصلاح هذا التنفيذ يجب عليك إضافة شرط لإيقاف العودة والتحقق أيضًا مما إذا كانت رسوم العقوبة ناجحة قبل إرجاع النتيجة النهائية
}
